CaseFolder/With_pisoFoam/OS/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1.45";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
5600
(
(2.30773 0.00773867 3.73074e-19)
(1.30164 0.00863861 -6.42027e-18)
(0.961557 0.00742883 6.40608e-18)
(1.0202 0.00536074 0)
(1.06482 0.00445454 0)
(1.05934 0.00467401 0)
(1.04701 0.00511863 -1.1955e-17)
(1.03922 0.00551077 1.19279e-17)
...
)
;

boundaryField
{
    topBoundary
    {
        type            symmetry;
    }
    subBoundary
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    upStream
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    downStream
    {
        type            zeroGradient;
    }
    bottomSymmetry
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
