CaseFolder/With_pisoFoam/OS/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1.45";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
5600
(
993.401
995.249
996.598
996.608
996.456
996.437
996.458
996.471
...
)
;

boundaryField
{
    topBoundary
    {
        type            symmetry;
    }
    subBoundary
    {
        type            zeroGradient;
    }
    upStream
    {
        type            fixedValue;
        value           uniform 1000;
    }
    downStream
    {
        type            zeroGradient;
    }
    bottomSymmetry
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
